<!-- GitHub Actions Terraform PR comment bot -->
#### Terraform Initialization ⚙️`success`

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
github_repository.repo["hetzner-iac-cac"]: Refreshing state... [id=hetzner-iac-cac]
github_repository.repo["infra"]: Refreshing state... [id=infra]
github_repository.repo["github-organization-as-code"]: Refreshing state... [id=github-organization-as-code]
github_repository.repo[".github"]: Refreshing state... [id=.github]
github_repository.repo["github-actions-and-workflows"]: Refreshing state... [id=github-actions-and-workflows]
github_repository.repo["ansible-collection"]: Refreshing state... [id=ansible-collection]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_repository_ruleset.all_repositories[".github/main_branch"] will be created
  + resource "github_repository_ruleset" "all_repositories" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "Main Branch"
      + node_id     = (known after apply)
      + repository  = ".github"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "~DEFAULT_BRANCH",
                ]
            }
        }

      + rules {
          + creation                      = true
          + deletion                      = true
          + required_linear_history       = true
          + required_signatures           = true
          + update                        = true
          + update_allows_fetch_and_merge = false

          + pull_request {
              + dismiss_stale_reviews_on_push     = false
              + require_code_owner_review         = false
              + require_last_push_approval        = false
              + required_approving_review_count   = 0
              + required_review_thread_resolution = false
            }
        }
    }

  # github_repository_ruleset.all_repositories["ansible-collection/main_branch"] will be created
  + resource "github_repository_ruleset" "all_repositories" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "Main Branch"
      + node_id     = (known after apply)
      + repository  = "ansible-collection"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "~DEFAULT_BRANCH",
                ]
            }
        }

      + rules {
          + creation                      = true
          + deletion                      = true
          + required_linear_history       = true
          + required_signatures           = true
          + update                        = true
          + update_allows_fetch_and_merge = false

          + pull_request {
              + dismiss_stale_reviews_on_push     = false
              + require_code_owner_review         = false
              + require_last_push_approval        = false
              + required_approving_review_count   = 0
              + required_review_thread_resolution = false
            }
        }
    }

  # github_repository_ruleset.all_repositories["github-actions-and-workflows/main_branch"] will be created
  + resource "github_repository_ruleset" "all_repositories" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "Main Branch"
      + node_id     = (known after apply)
      + repository  = "github-actions-and-workflows"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "~DEFAULT_BRANCH",
                ]
            }
        }

      + rules {
          + creation                      = true
          + deletion                      = true
          + required_linear_history       = true
          + required_signatures           = true
          + update                        = true
          + update_allows_fetch_and_merge = false

          + pull_request {
              + dismiss_stale_reviews_on_push     = false
              + require_code_owner_review         = false
              + require_last_push_approval        = false
              + required_approving_review_count   = 0
              + required_review_thread_resolution = false
            }
        }
    }

  # github_repository_ruleset.all_repositories["github-organization-as-code/main_branch"] will be created
  + resource "github_repository_ruleset" "all_repositories" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "Main Branch"
      + node_id     = (known after apply)
      + repository  = "github-organization-as-code"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "~DEFAULT_BRANCH",
                ]
            }
        }

      + rules {
          + creation                      = true
          + deletion                      = true
          + required_linear_history       = true
          + required_signatures           = true
          + update                        = true
          + update_allows_fetch_and_merge = false

          + pull_request {
              + dismiss_stale_reviews_on_push     = false
              + require_code_owner_review         = false
              + require_last_push_approval        = false
              + required_approving_review_count   = 0
              + required_review_thread_resolution = false
            }
        }
    }

  # github_repository_ruleset.all_repositories["hetzner-iac-cac/main_branch"] will be created
  + resource "github_repository_ruleset" "all_repositories" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "Main Branch"
      + node_id     = (known after apply)
      + repository  = "hetzner-iac-cac"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "~DEFAULT_BRANCH",
                ]
            }
        }

      + rules {
          + creation                      = true
          + deletion                      = true
          + required_linear_history       = true
          + required_signatures           = true
          + update                        = true
          + update_allows_fetch_and_merge = false

          + pull_request {
              + dismiss_stale_reviews_on_push     = false
              + require_code_owner_review         = false
              + require_last_push_approval        = false
              + required_approving_review_count   = 0
              + required_review_thread_resolution = false
            }
        }
    }

  # github_repository_ruleset.all_repositories["infra/main_branch"] will be created
  + resource "github_repository_ruleset" "all_repositories" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "Main Branch"
      + node_id     = (known after apply)
      + repository  = "infra"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "~DEFAULT_BRANCH",
                ]
            }
        }

      + rules {
          + creation                      = true
          + deletion                      = true
          + required_linear_history       = true
          + required_signatures           = true
          + update                        = true
          + update_allows_fetch_and_merge = false

          + pull_request {
              + dismiss_stale_reviews_on_push     = false
              + require_code_owner_review         = false
              + require_last_push_approval        = false
              + required_approving_review_count   = 0
              + required_review_thread_resolution = false
            }
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>
*Pushed by: @bruzina, Action: `pull_request`*